<template>
    <section class="clients">
        <h2 class="section-title">Клиентам</h2>
        <p class="section-text">Этот сайт — дипломный проект студента Яндекс.Практикума. Его цель — показать, чему научился студент, какими технологиями владеет.</p>
        <p class="section-text">Вёрстка сайта выполнена по методологии БЭМ. Это делает сайт гибким и масштабируемым. Кроме того, добавлять новые страницы и функциональность проще и быстрее, чем в проектах, выполненных по другим методологиям. Также сайт проще и дешевле поддерживать.</p>
        <p class="section-text">Карточки с новостями приходят с сервера и обрабатываются асинхронно. То есть сайт продолжает работать, пока от сервера приходит ответ. Это повышает удобство использования сервиса.</p>
        <p class="section-text">При создании проекта была использована сборка технологией Webpack. Это современный подход к разработке сайтов. Код оптимизируется, а значит, сайт работает быстрее. Также сайт работает в старых браузерах. Даже если посетители — пользователи старых операционных систем, у них не будет проблем с отображением. А значит, потенциальная аудитория возрастает.</p>
        <p class="section-text">Проект был проверен экспертами Яндекс.Практикума. Если вашему бизнесу нужен сайт, мы рекомендуем обратиться к этому студенту.</p>
    </section>
</template>

<script>
export default {

}
</script>

<style>
.clients {
    padding: 80px 104px 94px;
    background-color: #fff;
}

@media (max-width: 1439px) and (min-width: 768px) {
    .clients {
        padding: 30px 40px 26px;
    }
}

@media (max-width: 767px) and (min-width: 320px) {
    .clients {
        padding: 16px;
    }
}
</style>